{
	"termName": "Communication",
	"principleUrl": "communication",
	"sectionNumber": "304",
	"section": "Designing (service) journeys",
	"title": "Communication",
	"subHeader": "Design for lightweight and efficient communication.",
	"disciplines": ["Content design", "Service design"],
	"guidance": {
		"guidanceText01": "Digital and physical communciations have a carbon cost; research from OVO Energy suggests that the average email travels 15,000 km before getting to your screen, taking a considerable amount of power in data centres and computers to send, filter, and store each message. In turn, we need to question and evaluate the necessity of the communications we are sending.",
		"guidanceText02": "It is important we have a confident understanding of the needs of our users, alongside the needs of the business to truly evaluate the necessity of any communications sent and the value they add to users. If for business/behaviour change benefit, other options should be explored.",
		"guidanceText03": "If communications are deemed necessary, the impact of the chosen channel should be understood to inform design. Emails should be designed to be as lighweight as possible, avoiding attachments and image-heavy emails (an image-heavy email can cost approx. 50g of carbon). For email, communication should be designed in a way that minimises the time spent by the user on reading and understanding the email. Long, complex emails mean that users spend longer online reading them, having a higher carbon cost. If physical communications are the chosen route i.e. letter the material used needs to be considered in relation to carbon-cost and recyclability.",
		"guidanceText04": "To evaluate the ongoing effectiveness of communications, measures should be built into the service, and used, to evaluate comms i.e. open rate, click throughs, CTA success. This will allow BAU teams to monitor whether comms are still required."
	},
	"carbonImpact": {
		"impactText01": "Carbon impacts vary depending on the channel of communication and we should be mindful of this when designing.",
		"impactText02": "For email, the carbon footprint of a spam email is approx. 0.3g CO2, for a personal email it is 4g CO2 and an email with an attachment it is 50g CO2. In 2019, the world's 3.9 billion email users sent 294 billion emails, 55% of which we spam.",
		"impactText03": "Understanding how and if email communications are used is vital to understanding how necessary they are within the service and if they merit the CO2 emissions. In addition, emails left in inboxes have additional impacts on CO2 through data storage.",
		"impactText04": "Other communications could be in the form of  paper/post and telephone. The material used for postal communication should be considered against recyclability, the carbon cost of recycling, the likelihood to end up in landfill and the subsequent emissions associated with landfill waste. For telephone calls, landline, audio-only calls do have a much lower carbon impact than other mediums like video calls or zoom calls, but generate carbon emissions nonetheless."
	},
	"measures": {
		"measuresText01": "Click throughs",
		"measuresText02": "Open rate",
		"measuresText03": "Behaviour change/Action taken",
		"measuresText04": "Material recyclability"
	},
	"otherAreas": {
		"area01": "Inclusive Journeys",
		"area02": "Design for as few interactions as possible",
		"area03": "Navigation",
		"area04": "Accessibility",
		"area05": "Behaviour change"
	},
	"links": {
		"link01": {
			"linkDescription": "Link description:",
			"linkUrl": "https://www.emailonacid.com/blog/article/email-marketing/sustainable-email-marketing/"
		},
		"link02": {
			"linkDescription": "Link description:",
			"linkUrl": "https://gerrymcgovern.com/the-hidden-pollution-cost-of-online-meetings/"
		},
		"link03": {
			"linkDescription": "Link description:",
			"linkUrl": "https://theecobahn.com/ideas/edm-carbon-footprint-sustainable-email-marketing/"
		},
		"link04": {
			"linkDescription": "'How Bad are Bananas: The Carbon Footprint of Everything,' Mike Berners-Lee:",
			"linkUrl": "https://carbonliteracy.com/mike-berners-lee/"
		}
	}
}
