{
      "termName": "Short journeys",
      "principleUrl": "short-and-simple-journeys",
      "sectionNumber": "301",
      "section": "Designing (service) journeys",
      "title": "Short and simple journeys",
      "subHeader": "Design journeys so people can complete their goals in as quick and friction-free a way as possible.",
      "disciplines": ["Content design", "Interaction design", "Service design"],
      "guidance": {
        "guidanceText01": "Short and simple journeys that allow people to complete their goal(s) easily will save energy by reducing things like the amount of time someone needs to spend online. To do this, it is crucial to have a clear understanding of true user needs and to deliver against these. Be strict to deliver nothing more and nothing less.",
        "guidanceText02": "A comprehensive understanding of your user needs, combined with robust testing and prototyping, will highlight friction or pain points in your service that can be designed out. By doing this, it is more likely you will avoid unncecessary carbon costs associated with users looking for workarounds or needing to use other channels."
      },
      "carbonImpact": {
        "impactText01": "Short user journeys reduce: the amount of time people need to spend online; the amount of pages needed to complete a goal; the overall carbon impact of the service.",
        "impactText02": "Short and inclusive journeys avoid people needing to 'start again' through a different route after experiencing barriers to using the service.",
        "impactText03": "Removing friction and pain points from your service helps to reduce carbon impact by reducing energy used to: query, check, complain, or start again. Alternate channels such as email, chatbot and phone may also store the same contact details for organisational performance analysis, which will have a further carbon impact."
      },
      "measures": {
        "measuresText01": "Time on task ",
        "measuresText02": "Number of interactions",
        "measuresText03": "Service ticket analysis",
        "measuresText04": "Feedback channels",
        "measuresText05": "Failure demand"
      },
      "otherAreas": {
        "area01": "Inclusive Journeys",
        "area02": "Design for as few interactions as possible",
        "area03": "Navigation",
        "area04": "Accessibility"
      }, 
      "links": {
        "link01": {
          "linkDescription": "Link description:",
          "linkUrl": "https://sustainablewebdesign.org/have-user-journeys-been-planned-to-help-the-user-achieve-their-goals-efficiently/"
        },
        "link02": {
          "linkDescription": "Link description:",
          "linkUrl": "https://good.services/15-principles-of-good-service-design"
        }
      }
}
