{
	"termName": "Understand assets",
	"principleUrl": "understand-and-map-existing-assets",
	"sectionNumber": "306",
	"section": "Designing (service) journeys",
	"title": "Understand and map existing assets in the as-is service",
	"subHeader": "Uncover and map where existing content, web pages and data exists in the as-is service to ensure deletion if redundant within the new service.",
	"disciplines": ["Service design", "User research"],
	"guidance": {
		"guidanceText01": "When designing new or improved services, it is important to understand where, in the existing as-is service, there are existing webpages, content and data. These existing items should be considered and evaluated to understand whether they will be redundant within the new service.",
		"guidanceText02": "If deemed to be redundant, a plan should be in place to ensure they are fully deleted and disposed of as part of the transition into the new service. Research may be required in this evaluation to ensure no unintended impacts are felt from deletion and to avoid unneccessary energy invested in rectifying the problem this may cause.",
		"guidanceText03": "Ensuring old content is removed will also ensure your users have a more seamless experience, interacting with intended, current content only and avoiding additional need and energy invested in seeking help with using a service as a result of outdated content."
	},
	"carbonImpact": {
		"impactText01": "More than half of the data that is collected and stored is only used once and never re-used, yet it will still need to be stored digitally and will cause an unncecessary carbon cost. Production of digital data is increasing fast – this year the world is expected to generate 97 zettabytes (that is: 97 trillion gigabytes) of data. By 2025, it could almost double to 181 zettabytes.",
		"impactText02": "In addition, data centres (responsible for 2.5% of all human-induced carbon dioxide) have a greater carbon footprint than the aviation industry (2.1%).",
		"impactText03": "If data exists to support the old or previous service and is redundant, it is absolutely paramount to ensure it is deleted appropriately to avoid unnecessary carbon cost."
	},
	"measures": {
		"measuresText01": "Comparing your as-is state to your new live service",
		"measuresText02": "Track calls and queries relating to out-of-date information",
		"measuresText03": "Track reasons for assistance"
	},
	"otherAreas": {
		"area01": "Managing dark data",
		"area02": "Document storage and sharing",
		"area03": "Short & simple journeys"
	},
	"links": {
		"link01": {
			"linkDescription": "Gerry McGovern, World Wide Waste:",
			"linkUrl": "https://theconversation.com/dark-data-is-killing-the-planet-we-need-digital-decarbonisation-190423"
		}
	}
}