{
      "termName": "Reuse knowledge",
      "principleUrl": "reuse-knowledge",
      "sectionNumber": "503",
      "section": "Research",
      "title": "Reuse knowledge",
      "subHeader": "Dark data' (single use data generated by businesses during BAU activities) can have huge carbon costs. Large organisations often do a huge amount of research, how can we share and reuse our research and knowledge to avoid it become single-use?",
      "disciplines": ["User research"],
      "guidance": {
        "guidanceText01": "In large, complex organisation it is common that a lot of research is taking place, whether that's desk-based, remote or in-person user-research or data and performance analysis. Research is often commissioned and completed on a project by project basis. In turn, research is often completed and stored (recordings, research notes, reports, show and tells) for the design and delivery of one service, whereby it becomes 'dark data' within the organisation following the delivery of that service.",
        "guidanceText02": "We often find that research can be of use to teams outside of the relevant project team, so effort should be made to help teams reuse knowledge. ",
        "guidanceText03": "Where possible, build research libraries so that reseach can be retained and stored. This will allow signposting to research in a way that lets wider teams know the details of the research,  streamline future research efforts and reduce carbon impact by avoiding duplication. ",
        "guidanceText04": "Network with other research disciplines to find common research areas and findings to reduce the chance of duplication. "
      },
      "carbonImpact": {
        "impactText01": "More than half of the data that is collected and stored is only used once and never re-used. Tech Target have forecast that around 90% of data is never accessed three months are it is first stored. Yet it will still need to be stored digitally and will cause an unncecessary carbon cost. We generate a huge amount of data when designing and delivering services that may not be used again once the service is live. ",
        "impactText02": "In 2020, digitisation was purported to generate 4% of global greenhouse gas emissions. Production of digital data is increasing fast – this year (2022) the world is expected to generate 97 zettabytes (that is: 97 trillion gigabytes) of data. By 2025, it could almost double to 181 zettabytes. Data centres (responsible for 2.5% of all human-induced carbon dioxide) have a greater carbon footprint than the aviation industry (2.1%). ",
        "impactText03": "Very often in complex organisations, data that may be useful to other teams can get lost. An average email chasing information could cost around 0.3g CO2 and if a video call is required, this could add between 2-10g of CO2."
      },
      "otherAreas": {
        "area01": "Managing dark data",
        "area02": "Document storage and sharing",
        "area03": "Commute and travel"
      },
      "links": {
        "link01": {
          "linkDescription": "Link description:",
          "linkUrl": "https://www.emerald.com/insight/content/doi/10.1108/JBS-03-2022-0048/full/pdf?title=keeping-a-lower-profile-how-firms-can-reduce-their-digital-carbon-footprints"
        }
      }
}