{
  "termName": "Journeys",
      "principleUrl": "journeys-and-navigation",
      "sectionNumber": "601",
      "section": "Interfaces and interactions",
      "title": "Journeys and navigation",
      "subHeader": "Create journeys that allow users to complete tasks within the least number of steps. Start by designing the smallest journey possible that meets user needs.",
      "disciplines": ["Content design", "Interaction design"],
      "guidance": {
        "guidanceText01": "For every page load in your service there is a data transfer that results in energy consumption. Reducing the number of steps in a journey is an important way to reduce the carbon impact of your designs.",
        "guidanceText02": "When it comes to form design, the recommendation in the GOV.UK service manual is to start with one thing per page. For citizen-facing services this is a good approach. If you’re designing for more specialist users who repeat tasks, you may be able to merge pages together.",
        "guidanceText03": "When designing forms, work with business analysts to understand the information you need from users. Ensure there is a clear justification for all the information you ask for. Start with simple form designs and focus on creating the quickest route possible for the largest part of your audience.",
        "guidanceText04": "Design navigation and menus so users can quickly find their way to the content they need with the minimum number of unnecessary page loads. Ensure content is well structured and aim to reduce the time it takes for a user to achieve their goals.",
        "guidanceText05": "When creating short journeys, it’s critical that usability and accessibility aren’t sacrificed."
      },
      "carbonImpact": {
        "impactText01": "There is a close correlation between data transfer and energy consumption. Each page load increases the amount of energy used. As an example, if you have a transaction that is 6 pages long, and you can reduce this to 4 pages, you could reduce the energy consumption by over 30%.",
        "impactText02": "The average web page is estimated to be over 3mb in size, and whilst GOV.UK pages are much smaller in size, there is still an impact."
      },
      "measures": {
        "measuresText01": "Task completion rates",
        "measuresText02": "Length of time to complete tasks",
        "measuresText03": "Bounce rates can be used to measure the effectiveness of your navigation"
      },
      "otherAreas": {
        "area01": "",
        "area02": "",
        "area03": ""
      },
      "links": {
        "link01": {
          "linkDescription": "GDS Structuring forms:",
          "linkUrl": "https://www.gov.uk/service-manual/design/form-structure"
        },
        "link02": {
          "linkDescription": "Information Architecture basics:",
          "linkUrl": "https://www.usability.gov/what-and-why/information-architecture.html"
        }
      }
}