{
  "termName": "Video",
      "principleUrl": "video",
      "sectionNumber": "606",
      "section": "Interfaces and interactions",
      "title": "Video",
      "subHeader": "Video is one of the worst offenders for carbon on the web, consuming large amounts of data, and placing a heavy burden on processor power. Video is a powerful way to convey messages, but there are alternatives that can be as effective, without the same carbon impact.",
      "disciplines": ["Content design", "Interaction design"],
      "guidance": {
        "guidanceText01": "From a sustainability perspective, the best approach is to avoid using video. But if it’s your only option there are a few things you can do to reduce the carbon impact.",
        "guidanceText02": "Resolution: Scientists at the Royal Society calculated that 4K video generates eight time more emissions than a video in standard definition (SD). Platforms such as YouTube automatically stream to devices in Ultra HD, regardless of whether the device is capable of displaying in that resolution. Selecting the correct resolution for your video is crucial. Saving in 720p resolution is a good compromise. 720p is suitable for most use cases, but offers much smaller files sizes than 1080p or 4K resolution.",
        "guidanceText03": "Autoplay: Setting your videos to autoplay is bad for both the environment and usability. Giving the user control of starting the video will prevent needless streaming.",
        "guidanceText04": "Video length: Avoid lengthy intros and get straight to the point. Designing for public services means we don’t need to worry too much about tailoring the video to the YouTube algorithms.",
        "guidanceText05": "File format: Saving a video in the most suitable format can have a big impact. MPEG-4/H.264 format is supported in most browsers and delivers compressed file sizes. Newer formats such as WEBM can deliver smaller sizes, but aren’t as well supported in browsers."
      },
      "carbonImpact": {
        "impactText01": "In Europe, the average amount of CO2 generated per hour of video streaming is 55g per person. This is equal to boiling an electric kettle three times.*",
        "impactText02": "By far the most data and processing intensive form of content is video. ‘A website with video playing can be one or even two orders of magnitude heavier than a website without video in terms of page weight and creates much higher load on the users CPU, resulting in vastly greater energy consumption.’ (Quoted from wholegraindigital)"
      },
      "measures": {
        "measuresText01": "Video file sizes"
      },
      "links": {
        "link01": {
          "linkDescription": "Impact of streaming video:",
          "linkUrl": "https://www.carbontrust.com/news-and-events/news/updated-calculation-released-on-the-carbon-impact-of-online-video-streaming"
        },
        "link02": {
          "linkDescription": "Website energy efficiency:",
          "linkUrl": "https://www.wholegraindigital.com/blog/website-energy-efficiency/"
        },
        "link03": {
          "linkDescription": "'Webwaste' chapter in World Wide Waste, Gerry McGovern:",
          "linkUrl": "https://theconversation.com/the-internet-consumes-extraordinary-amounts-of-energy-heres-how-we-can-make-it-more-sustainable-160639"
        }
      }
}