{
  "termName": "Css interactions",
      "principleUrl": "css-interactions",
      "sectionNumber": "607",
      "section": "Interfaces and interactions",
      "title": "CSS",
      "subHeader": "The way you implement CSS within your prototypes can impact page weight and CPU usage. Design decisions made at this stage can carry forward into the live service.",
      "disciplines": ["Interaction design"],
      "guidance": {
        "guidanceText01": "At this stage of the process, it’s typical that working prototypes are built to test ideas with users. Prototypes should be disposable, but decisions made at this point can carry forward into the final build.",
        "guidanceText02": "From a visual perspective, modern CSS offers a wealth of options to embellish your designs. Be careful how these are used, as they can be processor intensive, impacting the battery-life of devices and energy consumption.",
        "guidanceText03": "The way you create your CSS markup also has an impact on page weight. The GOV.UK Prototype Kit supports the use of Sass variables. Sass allows you to create re-usable variables that are the compiled back into the master CSS file. Using these variables can reduce the size of your markup.",
        "guidanceText04": "If you use images within your service, consider combining into a single CSS sprite. This will reduce the number of HTTP server requests and can lead to faster performance for users.",
        "guidanceText05": "To further reduce file sizes, you can also Minify your code, which removes unnecessary whitespace and increases page speed.",
        "guidanceText06": "Collaborate with front-end developers when handing over designs, to ensure carbon impact is considered in the final build."
      },
      "carbonImpact": {
        "impactText01": "Advanced CSS styles can increase device CPU usage and increase users' energy consumption.",
        "impactText02": "The way you implement CSS markup can impact page size and speed."
      },
      "measures": {
        "measuresText01": "Most browsers have a developer mode where you can check CPU usage, alternatively, use online tools such as PageSpeed Insights to measure real world performance"
      },
      "links": {
        "link01": {
          "linkDescription": "Don’t burn your CPU with CSS animations:",
          "linkUrl": "https://betterprogramming.pub/do-not-burn-you-cpu-working-with-css-animations-e4d19069fb0f"
        },
        "link02": {
          "linkDescription": "SASS for Designers using the GOV.UK Prototype Kit:",
          "linkUrl": "https://medium.com/@onebc/sass-for-designers-using-the-gov-uk-prototype-kit-88e0a4f92dc2"
        },
        "link03": {
          "linkDescription": "Minify CSS tool:",
          "linkUrl": "https://cssminifier.org/"
        },
        "link04": {
          "linkDescription": "Google PageSpeed Insights:",
          "linkUrl": "https://pagespeed.web.dev/"
        }
      }
}